class RenterInfo:
    RENTER_PHONE_NUMBER = {
        "uzl": "Endi, ijaraga oluvchining telefon raqamini kiriting",
        "uzk": "Энди, ижарага олувчининг телефон рақамини киритинг",
        "rus": "Теперь введите номер телефона арендатора.",
    }

    RENTER_PASSPORT_INFO = {
        "uzl": "Ijaraga oluvchining passport ma'lumotlarini kiriting <b>(AC1234567)</b>: ",
        "uzk": "Ижарага олувчининг пасспорт маълумотларини киритинг <b>(АС1234567)</b>: ",
        "rus": "Введите паспортные данные арендатора <b>(AC1234567)</b>: ",
    }

    INVALID_RENTER_FULLNAME = {
        "uzl": "Ism va familiyani matn ko'rinishida kiritng",
        "uzk": "Исм ва фамилияни матн кўринишида киритнг",
        "rus": "Введите ваше имя и фамилию в текстовом формате.",
    }

    HOZIRCHA = {
        "uzl": "Bot, hozircha shu jarayongacha yozildi.\n"
               "Hali yana texnik jarayonlar olib borilmoqda.\n"
               "To'g'ri tushunasiz degan umiddaman!😉\n\n"
               "Savol, taklif va muraajatlar uchun: Telegram: t.me/javohir_abduhakimoff\n"
               "Telefon raqam: +998930098323",

        "uzk": "Бот, ҳозирча шу жараёнгача ёзилди.\n"
               "Ҳали яна техник жараёнлар олиб борилмоқда.\n"
               "Тўғри тушунасиз деган умиддаман!😉\n\n"
               "Савол, таклиф ва мураажатлар учун: Телеграм: т.ме/жавоҳир_абдуҳакимофф\n"
               "Телефон рақам: +998930098323",

        "rus": "Бот временно подготовлен к этому процессу.\n"
               "В настоящее время ведутся технические работы."
               "Надеюсь, вы всё правильно поняли!😉"
               "Для вопросов, предложений изапросов:\n"
               "Telegram: t.me/javohir_abduhakimoff\n"
               "Номер телефона: +998930098323",
    }
